Tekla Open API Reference for Tekla Structures 2025
TransformationPlane.TransformationMatrixToGlobal Property
 Gives a transformation matrix for converting local points in the transformation plane to global coordinates.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Matrix TransformationMatrixToGlobal { get; }
Public ReadOnly Property TransformationMatrixToGlobal As Matrix
	Get
Property Value
Type: Matrix
See Also
Reference
TransformationPlane Class
Tekla.Structures.Model Namespace